viscoelastic/viscoelasticFluidFoam/lidDrivenCavity/VLDCM2/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

 echo "Running blockMesh application"
 runApplication blockMesh
 
 echo "Running decompose domain"
 runApplication decomposePar
 
 echo "Running viscoelasticFluidFoam solver"
 mpirun -np 4 viscoelasticFluidFoam -parallel > log &
 
 echo "done!"


